In [1]:
import pandas as pd
import os

In [2]:
df1 = pd.read_csv(os.path.join('machine_learning_variables.csv'))
df1 = df1[['UNITID', 'INSTNM']]
df1.head()

   UNITID                               INSTNM
0  100654             Alabama A & M University
1  100663  University of Alabama at Birmingham
2  100690                   Amridge University
3  100706  University of Alabama in Huntsville
4  100724             Alabama State University

In [3]:
df1.nunique()

UNITID    7703
INSTNM    7522
dtype: int64

In [4]:
df2 = pd.read_csv(os.path.join('FourYearUniversities.csv'))
df2 = df2[['UNITID']]
df2.head()

   UNITID
0  100654
1  100663
2  100690
3  100706
4  100724

In [5]:
df2.nunique()

UNITID    1841
dtype: int64

In [6]:
df3 = pd.merge(df2,df1, on='UNITID', how='inner')

In [7]:
df3.head()

   UNITID                               INSTNM
0  100654             Alabama A & M University
1  100663  University of Alabama at Birmingham
2  100690                   Amridge University
3  100706  University of Alabama in Huntsville
4  100724             Alabama State University

In [8]:
df3.nunique()

UNITID    1841
INSTNM    1824
dtype: int64

In [10]:
df3.to_csv(os.path.join('API_SQL_UNITID-NAME.csv'))